MinhDinhTran/eBike/STM32F4_MotorControl/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * This notice applies to any and all portions of this file
 * that are not between comment pairs USER CODE BEGIN and
 * USER CODE END. Other portions of this file, whether
 * inserted by the user or by software development tools
 * are owned by their respective copyright owners.
 *
 * Copyright (c) 2018 STMicroelectronics International N.V.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted, provided that the following conditions are met:
 *
 * 1. Redistribution of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of STMicroelectronics nor the names of other
 *    contributors to this software may be used to endorse or promote products
 *    derived from this software without specific written permission.
 * 4. This software, including modifications and/or derivative works of this
 *    software, must execute solely and exclusively on microcontroller or
 *    microprocessor devices manufactured by or for STMicroelectronics.
 * 5. Redistribution and use of this software other than as permitted under
 *    this license is void and will automatically terminate your rights under
 *    this license.
 *
 * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
 * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
 * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT
 * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"
#include "usb_device.h"

/* USER CODE BEGIN Includes */
#include "MC.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;
ADC_HandleTypeDef hadc3;

DAC_HandleTypeDef hdac;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim9;
TIM_HandleTypeDef htim10;

UART_HandleTypeDef huart3;

osThreadId defaultTaskHandle;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_TIM1_Init(void);
static void MX_RTC_Init(void);
static void MX_SPI2_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_ADC3_Init(void);
static void MX_ADC2_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM9_Init(void);
static void MX_TIM10_Init(void);
static void MX_DAC_Init(void);
void StartDefaultTask(void const * argument);

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void Error_Handler_ISR() {
	Error_Handler();
}
extern void Start_MotorControlThread(void);
extern void Start_BT_Task(void);
extern void Start_USB_Task(void);
extern void TurnAllPWMsOFF(void);
extern void Start_SDCard_Task(void);
/* USER CODE END PFP */
#include "MyMsg.h"
void Test_MyMsg()
{

	char* res;
	char res2;
	for (int i = 0; i < 10000000; i++)
        {
		MyMsg_CacheStringPiece_ISR((char)0);
		MyMsg_CacheStringPiece_ISR((char)0x0A);
		MyMsg_CacheStringPiece_ISR((char)0x0D);
		MyMsg_CacheStringPiece_ISR((char)14);
		MyMsg_CacheStringPiece_ISR((char)0x00);
		MyMsg_CacheStringPiece_ISR((char)0x00);
		MyMsg_CacheStringPiece_ISR((char)0x00);
		MyMsg_CacheStringPiece_ISR((char)0x01);
		MyMsg_CacheStringPiece_ISR((char)0x01);
		MyMsg_CacheStringPiece_ISR((char)0x02);
		MyMsg_CacheStringPiece_ISR((char)0x03);
		MyMsg_CacheStringPiece_ISR((char)0x04);
		MyMsg_CacheStringPiece_ISR((char)0x05);
		MyMsg_CacheStringPiece_ISR((char)0x0A);
		MyMsg_CacheStringPiece_ISR((char)0x0D);
		MyMsg_CacheStringPiece_ISR((char)0);
		MyMsg_t* msg = MyMsg_ProcessCache();
		if (msg != NULL)
			res = (char*) msg->pData;
		else
			while(1);

		res2 = *res;
		if (res2 != 1)
			while(1);
		res++;
		res2 = *res;
		if (res2 != 2)
			while(1);
		res++;
		res2 = *res;
		if (res2 != 3)
			while(1);
		res++;
		res2 = *res;
		if (res2 != 4)
			while(1);
		free(msg->pData);
		free(msg);
	}
}
/* USER CODE BEGIN 0 */
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 *
 * @retval None
 */
int main(void) {
	/* USER CODE BEGIN 1 */

	 Test_MyMsg();
	/* USER CODE END 1 */

	/* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_TIM1_Init();
	MX_RTC_Init();
	MX_SPI2_Init();
	MX_USART3_UART_Init();
	MX_ADC3_Init();
	MX_ADC2_Init();
	MX_ADC1_Init();
	MX_TIM9_Init();
	MX_TIM10_Init();
	MX_DAC_Init();
	/* USER CODE BEGIN 2 */


	/* USER CODE END 2 */

